RIET/src/Documents/CustomsPaymentAllocation/CustomsPaymentAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsPaymentAllocation</name>
  <basedOn>Document.CustomsPayment</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.FutureCustomsPayments</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <registerRecords>AccumulationRegister.UnpaidCCDs</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>AccumulationRegister.UnpaidFutureCustomsPayments</registerRecords>
  <registerRecords>AccumulationRegister.UnallocatedCustomsPayments</registerRecords>
  <attributes>
    <name>CustomsPayment</name>
    <type>
      <types>DocumentRef.CustomsPayment</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDocument</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/AccumulationRegisters/UnpaidCCDs/UnpaidCCDs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>UnpaidCCDs</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>CCD</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/НеоплаченныеТПО/НеоплаченныеТПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеоплаченныеТПО</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТПО</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/CustomsPayment/CustomsPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsPayment</name>
  <registerRecords>AccumulationRegister.UnallocatedCustomsPayments</registerRecords>
  <attributes>
    <name>TypeOfPayment</name>
    <type>
      <types>EnumRef.CustomsPaymentsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccountsForCustomsPayments</types>
    </type>
  </attributes>
  <attributes>
    <name>Customs</name>
    <type>
      <types>CatalogRef.Customs</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬCustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>CCDReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsCard</name>
    <type>
      <types>CatalogRef.CustomsCards</types>
    </type>
  </attributes>
  <attributes>
    <name>CheckNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsPaymentAllocation/Forms/ФормаДокумента/Module.bsl
//////////////////////////////////////////////////////////////////////////////
// ФОРМА

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ТочноеВремяНачала = ОценкаПроизводительностиРГСофт.ТочноеВремя();
	
	ЗаполнитьCustomsPaymentUnallocatedSumИCustomsDocumentPaymentKindUnpaidSum();
		
	Если НЕ ЗначениеЗаполнено(Объект.CustomsPayment) Тогда
		ТекущийЭлемент = Элементы.CustomsPayment;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.CustomsDocument) Тогда
		ТекущийЭлемент = Элементы.CustomsDocument;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Sum) Тогда
		ТекущийЭлемент = Элементы.Sum;
	Иначе
		ТекущийЭлемент = Элементы.Comment;
	КонецЕсли;
	
	//ОценкаПроизводительностиРГСофт.ЗафиксироватьВремяОкончания(ТочноеВремяНачала, Справочники.КлючевыеОперации.PaymentAllocationОткрытие, Объект.Ссылка);
	
КонецПроцедуры  


//////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	ПараметрыЗаписи.Вставить("ТочноеВремяНачала", ОценкаПроизводительностиРГСофт.ТочноеВремя());
	//КонецЕсли;
	
	ТекущийОбъект.LastModified = ТекущаяДата();
	ОбщегоНазначения.УстановитьЗначение(ТекущийОбъект.Responsible, ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьCustomsPaymentUnallocatedSumИCustomsDocumentPaymentKindUnpaidSum();
	
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	ОценкаПроизводительностиРГСофт.ЗафиксироватьВремяОкончания(ПараметрыЗаписи.ТочноеВремяНачала, Справочники.КлючевыеОперации.PaymentAllocationИнтерактивноеПроведение, Объект.Ссылка);
	//КонецЕсли;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CustomsPayment", Объект.CustomsPayment);
	СтруктураПараметров.Вставить("CustomsDocument", Объект.CustomsDocument);
	Оповестить("ИзмененДокументCustomsPaymentAllocation", СтруктураПараметров);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////
// ШАПКА

// CUSTOMS PAYMENT

&НаКлиенте
Процедура CustomsPaymentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Имя", "ВыборИзCustomsPaymentAllocation");
	СтруктураНастройки.Вставить("CustomsDocument", Объект.CustomsDocument);
	СтруктураНастройки.Вставить("PaymentKind", Объект.PaymentKind);
	СтруктураНастройки.Вставить("CurrentCustomsPayment", Объект.CustomsPayment);
		
	СтруктураПараметров = Новый Структура("СтруктураНастройки", СтруктураНастройки);
	ОткрытьФорму("Документ.CustomsPayment.ФормаВыбора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура CustomsPaymentПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.CustomsPayment) Тогда
		
		СтруктураДанных = ПолучитьСтруктуруДанныхПриИзмененииCustomsPayment(Объект.CustomsPayment, Объект.CustomsDocument, Объект.PaymentKind);
		CustomsPaymentUnallocatedSum = СтруктураДанных.CustomsPaymentUnallocatedSum;
		Если Объект.PaymentKind <> СтруктураДанных.PaymentKind Тогда
			Объект.PaymentKind = СтруктураДанных.PaymentKind;
			CustomsDocumentPaymentKindUnpaidSum = СтруктураДанных.CustomsDocumentPaymentKindUnpaidSum;
		КонецЕсли;
		
	Иначе
		CustomsPaymentUnallocatedSum = 0;
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруДанныхПриИзмененииCustomsPayment(CustomsPayment, CustomsDocument, PaymentKind)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("PaymentKind", PaymentKind);
	СтруктураВозврата.Вставить("CustomsPaymentUnallocatedSum", 0);
	
	// Получим несаллокированный остаток и Payment kind
	Если ЗначениеЗаполнено(CustomsPayment) Тогда
		
		СтруктураТекстов = Новый Структура;
		СтруктураПараметров = Новый Структура;
		
		СтруктураПараметров.Вставить("CustomsPayment", CustomsPayment);
		
		СтруктураТекстов.Вставить("CustomsPaymentUnallocatedSum",
			CustomsСервер.ПолучитьТекстЗапросаCustomsPaymentUnallocatedSum());
			
		СтруктураТекстов.Вставить("РеквизитыCustomsPayment",
			"ВЫБРАТЬ
			|	CustomsPayment.PaymentKind
			|ИЗ
			|	Документ.CustomsPayment КАК CustomsPayment
			|ГДЕ
			|	CustomsPayment.Ссылка = &CustomsPayment");
			
		СтруктураРезультатов = РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
		
		Выборка = СтруктураРезультатов.CustomsPaymentUnallocatedSum.Выбрать();
		Если Выборка.Следующий()
			И ЗначениеЗаполнено(Выборка.SumОстаток) Тогда
			СтруктураВозврата.CustomsPaymentUnallocatedSum = Выборка.SumОстаток;
		КонецЕсли;
		
		Выборка = СтруктураРезультатов.РеквизитыCustomsPayment.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.PaymentKind) Тогда
			СтруктураВозврата.PaymentKind = Выборка.PaymentKind;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(CustomsDocument)
		И PaymentKind <> СтруктураВозврата.PaymentKind Тогда
		
		CustomsDocumentPaymentKindUnpaidSum = ПолучитьCustomsDocumentPaymentKindUnpaidSum(CustomsDocument, СтруктураВозврата.PaymentKind);
		СтруктураВозврата.Вставить("CustomsDocumentPaymentKindUnpaidSum", CustomsDocumentPaymentKindUnpaidSum);		
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// CUSTOM DOCUMENT

&НаКлиенте
Процедура CustomsDocumentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("ДокументСсылка.ГТД"), "ГТД");
	СписокТипов.Добавить(Тип("ДокументСсылка.CustomsFilesLight"), "ТПО");
		
	ЗначениеВыбора = ВыбратьИзСписка(СписокТипов, Элемент);
	Если ЗначениеВыбора <> Неопределено Тогда
		
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("Имя", "ВыборИзCustomsPaymentAllocation");
		СтруктураНастройки.Вставить("CustomsPayment", Объект.CustomsPayment);
		СтруктураНастройки.Вставить("CurrentCustomsDocument", Объект.CustomsDocument);
		СтруктураПараметров = Новый Структура("СтруктураНастройки", СтруктураНастройки);
		
		Если ЗначениеВыбора.Значение = Тип("ДокументСсылка.ГТД") Тогда
			
			ОткрытьФорму("Документ.ГТД.ФормаВыбора", СтруктураПараметров, Элемент);
			
		ИначеЕсли ЗначениеВыбора.Значение = Тип("ДокументСсылка.CustomsFilesLight") Тогда 
			
			ОткрытьФорму("Документ.CustomsFilesLight.ФормаВыбора", СтруктураПараметров, Элемент);
						
		КонецЕсли; 
		
	КонецЕсли;
					
КонецПроцедуры  

&НаКлиенте
Процедура CustomsDocumentПриИзменении(Элемент)
	
	ПриИзмененииCustomsDocumentИлиPaymentKind();
		
КонецПроцедуры

&НаКлиенте
Процедура PaymentKindПриИзменении(Элемент)
	
	ПриИзмененииCustomsDocumentИлиPaymentKind();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииCustomsDocumentИлиPaymentKind()
	
	CustomsDocumentPaymentKindUnpaidSum = 0;
	Если ЗначениеЗаполнено(Объект.CustomsDocument) И ЗначениеЗаполнено(Объект.PaymentKind) Тогда
		CustomsDocumentPaymentKindUnpaidSum = ПолучитьCustomsDocumentPaymentKindUnpaidSum(Объект.CustomsDocument, Объект.PaymentKind);
	КонецЕсли; 
		
	Если НЕ ЗначениеЗаполнено(Объект.Sum) Тогда
		Объект.Sum = Мин(CustomsPaymentUnallocatedSum, CustomsDocumentPaymentKindUnpaidSum);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьCustomsDocumentPaymentKindUnpaidSum(CustomsDocument, PaymentKind)
	
	CustomsDocumentPaymentKindUnpaidSum = 0;
	
	Если ЗначениеЗаполнено(CustomsDocument)
		И ЗначениеЗаполнено(PaymentKind) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("PaymentKind", PaymentKind);
		
		ТипЗнчCustomsDocument = ТипЗнч(CustomsDocument);
		Если ТипЗнчCustomsDocument = Тип("ДокументСсылка.ГТД") Тогда
			Запрос.УстановитьПараметр("CCD", CustomsDocument);
			Запрос.Текст = ПолучитьТекстЗапросаCCDPaymentKindUnpaidSum();
		ИначеЕсли ТипЗнчCustomsDocument = Тип("ДокументСсылка.CustomsFilesLight") Тогда
			Запрос.УстановитьПараметр("ТПО", CustomsDocument);
			Запрос.Текст = ПолучитьТекстЗапросаТПОPaymentKindUnpaidSum();
		КонецЕсли;
						
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.SumОстаток) Тогда
				Возврат Выборка.SumОстаток;
			КонецЕсли; 	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат CustomsDocumentPaymentKindUnpaidSum;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаCCDPaymentKindUnpaidSum()
	
	Возврат
		"ВЫБРАТЬ
		|	UnpaidCCDsОстатки.SumОстаток КАК SumОстаток
		|ИЗ
		|	РегистрНакопления.UnpaidCCDs.Остатки(
		|			,
		|			CCD = &CCD
		|				И PaymentKind = &PaymentKind) КАК UnpaidCCDsОстатки";
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаТПОPaymentKindUnpaidSum()
	
	Возврат
		"ВЫБРАТЬ
		|	НеоплаченныеТПООстатки.SumОстаток КАК SumОстаток
		|ИЗ
		|	РегистрНакопления.НеоплаченныеТПО.Остатки(
		|			,
		|			ТПО = &ТПО
		|				И PaymentKind = &PaymentKind) КАК НеоплаченныеТПООстатки";
		
КонецФункции
	

//////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ

&НаСервере
Процедура ЗаполнитьCustomsPaymentUnallocatedSumИCustomsDocumentPaymentKindUnpaidSum()
	
	CustomsPaymentUnallocatedSum = 0;
	CustomsDocumentPaymentKindUnpaidSum = 0;
	
	СтруктураПараметров = Новый Структура;
	СтруктураТекстов = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.CustomsPayment) Тогда
		
		СтруктураПараметров.Вставить("CustomsPayment", Объект.CustomsPayment);
		СтруктураТекстов.Вставить("CustomsPaymentUnallocatedSum",
			CustomsСервер.ПолучитьТекстЗапросаCustomsPaymentUnallocatedSum());
			
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.CustomsDocument) И ЗначениеЗаполнено(Объект.PaymentKind) Тогда
	
		СтруктураПараметров.Вставить("PaymentKind", Объект.PaymentKind);
		
		ТипЗнчCustomsDocument = ТипЗнч(Объект.CustomsDocument);
		Если ТипЗнчCustomsDocument = Тип("ДокументСсылка.ГТД") Тогда
			СтруктураПараметров.Вставить("CCD", Объект.CustomsDocument);
			ТекстЗапросаCustomsDocumentPaymentKindUnpaidSum = ПолучитьТекстЗапросаCCDPaymentKindUnpaidSum();
		ИначеЕсли ТипЗнчCustomsDocument = Тип("ДокументСсылка.CustomsFilesLight") Тогда
			СтруктураПараметров.Вставить("ТПО", Объект.CustomsDocument);
			ТекстЗапросаCustomsDocumentPaymentKindUnpaidSum = ПолучитьТекстЗапросаТПОPaymentKindUnpaidSum();
		КонецЕсли;	
		СтруктураТекстов.Вставить("CustomsDocumentPaymentKindUnpaidSum", ТекстЗапросаCustomsDocumentPaymentKindUnpaidSum);
		
	КонецЕсли; 
		
	СтруктураРезультатов = РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
	
	Если СтруктураРезультатов.Свойство("CustomsPaymentUnallocatedSum") Тогда
		
		Выборка = СтруктураРезультатов.CustomsPaymentUnallocatedSum.Выбрать();
		Если Выборка.Следующий()
			И ЗначениеЗаполнено(Выборка.SumОстаток) Тогда
			CustomsPaymentUnallocatedSum = Выборка.SumОстаток;
		КонецЕсли; 
		
	КонецЕсли;
		
	Если СтруктураРезультатов.Свойство("CustomsDocumentPaymentKindUnpaidSum") Тогда
		
		Выборка = СтруктураРезультатов.CustomsDocumentPaymentKindUnpaidSum.Выбрать();
		Если Выборка.Следующий()
			И ЗначениеЗаполнено(Выборка.SumОстаток) Тогда
			CustomsDocumentPaymentKindUnpaidSum = Выборка.SumОстаток;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Sum) Тогда
		Объект.Sum = Мин(CustomsPaymentUnallocatedSum, CustomsDocumentPaymentKindUnpaidSum);
	КонецЕсли;
	
КонецПроцедуры
